tap "homebrew/bundle"
brew "awscli"
brew "git"
brew "graphviz"
brew "grep"
brew "imagemagick"
brew "jq"
brew "mas"
brew "n"
brew "neovim"
brew "poetry"
brew "pyenv"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
cask "cheatsheet"
cask "intellij-idea-ce"
cask "notion"
cask "rancher"
cask "rectangle"
cask "utm"
cask "visual-studio-code"
if OS.mac?
  mas "Bitwarden", id: 1352778147
  mas "Microsoft Remote Desktop", id: 1295203466
  mas "Spark", id: 1176895641
  mas "The Unarchiver", id: 425424353
  mas "Xcode", id: 497799835
end
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "astro-build.astro-vscode"
vscode "bbenoist.vagrant"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "Dagger.dagger"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gera2ld.markmap-vscode"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "IBM.output-colorizer"
vscode "ICS.japanese-proofreading"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jrebocho.vscode-random"
vscode "marcostazi.VS-code-vagrantfile"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-playwright.playwright"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.LiveServer"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "xyc.vscode-mdx-preview"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
